{
  "Header": {
    "popup": "Download my CV by clicking on the picture above.",
    "search": "Search"
  },

  "Modal": {
    "reset": "Reset"
  },

  "Title": {
    "clickHere": "Click here to contact me!",
    "dialog": {
      "title": "Hello!",
      "description": "Would you like to contact me? I will respond as soon as possible.",
      "yes": "Yes",
      "no": "No"
    }
  },

  "Post": {
    "comments": "comments",
    "shares": "shares",
    "like": "Like",
    "comment": "Comment",
    "share": "Share",
    "shareAction": {
      "title": "Share my portfolio!",
      "text": "Feel free to share my portfolio with others!",
      "error": "Your browser does not support the 'share' function."
    }
  },

  "YouteTube": {
    "description1": "I built a YouTube clone using React, TypeScript, and Vite. For handling dates and time formatting, I integrated Moment.js. To manage routing within the application, I utilized React Router. The project is styled using Tailwind CSS, which allowed for a responsive and modern design. This project served as a great opportunity for me to enhance my skills in front-end development and work with popular libraries and frameworks."
  },

  "Toolbox": {
    "description1": "I built this toolbox with Next.js, and I'm continuously improving it. My goal is to gather different useful features and keep expanding it with new tools over time. This project also serves as a playground for me to explore modern web technologies and strengthen my front-end development skills."
  },

  "Francorchamps": {
    "description1": "During my free time, I developed a website for the Rotary Club in my city. The site allows users to register for an event that has been taking place every year since 2024. It is built with Next.js for the frontend, Node.js for the backend and Prisma as ORM.",
    "description2": "I used SASS extensively for the design and Tailwind CSS for responsiveness.",
    "description3": "I use the Stripe API for payments and Resend for confirmation emails.",
    "description4": "The form was created with react-hook-form and field validation with Zod."
  },

  "Aviron": {
    "description": "As a final project at BeCode, I developed the redesign of the rowing club's website at ULiège with three other colleagues. The site allows admins to manage members and display the latest events and photos. Our team consisted of two frontend developers (including me) and two backend developers. It is built with NextJs for the frontend and Laravel for the backend."
  },

  "Introduction": {
    "description": "Having recently completed the Junior Developer training at BeCode and complemented it with an enriching internship at EVS Broadcast, I am looking for an opportunity to leverage my skills in a professional environment. I am punctual, dedicated, comfortable in collaborative environments, and eager to contribute to a team while continuing to develop my skills.",
    "help": "Eligible for the PFI scheme and access to Impulsion 12 months +"
  },

  "Skills": "TECHNICAL SKILLS",

  "Contact": {
    "title": {
      "prefix": "Leave me a ",
      "emphasis": "message"
    },
    "name": "Name",
    "email": "Email address",
    "message": "Message",
    "send": {
      "title": "Send message",
      "success": "Message sent successfully!",
      "error": "Failed to send message.",
      "bot": "Validation error. Are you a robot?"
    },
    "error": {
      "name": "Please enter your name",
      "nameMax": "Name cannot exceed 70 characters",
      "email": "Please enter a valid email address",
      "emailRequired": "Please enter an email address",
      "emailMax": "Email cannot exceed 320 characters",
      "message": "Please enter a message",
      "messageMax": "Message cannot exceed 1200 characters"
    }
  }
}
