{
  "Header": {
    "popup": "Téléchargez mon cv en cliquant sur la photo au dessus.",
    "search": "Rechercher"
  },

  "Modal": {
    "reset": "Recentrer"
  },

  "Title": {
    "clickHere": "Cliquez ici pour me contacter!",
    "dialog": {
      "title": "Bonjour!",
      "description": "Souhaitez-vous me contacter? Je vous répondrai dans les plus brefs délais.",
      "yes": "Oui",
      "no": "Non"
    }
  },

  "Post": {
    "comments": "commentaires",
    "shares": "partages",
    "like": "Aimer",
    "comment": "Commenter",
    "share": "Partager",
    "shareAction": {
      "title": "Partagez mon portfolio!",
      "text": "N'hésitez pas à partager mon portfolio autour de vous!",
      "error": "Votre navigateur ne supporte pas la fonction 'share'"
    }
  },

  "Francorchamps": {
    "description1": "Lors de mon temps libre, j'ai développé un site web pour le Rotary de la ville de Herve. Le site permet aux utilisateurs de s'inscrire à un évènement qui se déroule chaque année depuis 2024. Il est construit avec Next.js pour le frontend, Node.js pour le backend et Prisma comme ORM.",
    "description2": "J'ai utilisé SASS en grande partie pour le design et Tailwind CSS pour le responsive.",
    "description3": "J'utilise l'api Stripe pour le paiement et Resend pour l'email de confirmation.",
    "description4": "Le formulaire a été réalisé avec react-hook-form et la validation des champs avec Zod."
  },

  "Aviron": {
    "description": "Comme projet de fin de formation chez BeCode, j'ai développé la refonte du site web du club d'aviron de l'ULiège à l'aide de trois autres collègues. Le site permet aux admins de gérer les membres et d'afficher les derniers évenements et photos. Notre équipe était composée de deux développeurs frontend (dont moi) et deux backend. Il est construit avec NextJs pour le frontend et Laravel pour le backend."
  },

  "Introduction": {
    "description": "Ayant récemment terminé la formation Junior Développeur chez BeCode et complété celle ci par un stage enrichissant chez EVS Broadcast, je suis à la recherche d une opportunité pour mettre à profit mes compétences dans un environnement professionnel. Je suis ponctuel, dévoué, à l'aise dans les environnements collaboratifs et impatient d'apporter ma contribution à une équipe tout en continuant à développer mes compétences.",
    "help": "Éligible au dispositif PFI et accès à Impulsion 12 mois +"
  },

  "Skills": "COMPÉTENCES TECH",

  "Contact": {
    "title": {
      "prefix": "Laissez moi un ",
      "emphasis": "message"
    },
    "name": "Nom",
    "email": "Adresse email",
    "message": "Message",
    "send": {
      "title": "Envoyer le message",
      "success": "Message envoyé avec succès!",
      "error": "Erreur lors de l'envoi du message.",
      "bot": "Le message n'a pas pu être envoyé car vous êtes un robot."
    },
    "error": {
      "name": "Veuillez saisir votre nom",
      "email": "Veuillez saisir une adresse email valide",
      "emailRequired": "Veuillez saisir une adresse email",
      "message": "Veuillez saisir un message"
    }
  }
}
